{
    "productList": [
        {   
        	"type": "家用电器",
            "products": [
                {
                    "name": "燃气灶"
                },{
                    "name": "抽烟机"
                },{
                    "name": "热水器"
                },{
                    "name": "电视"
                },{
                    "name": "空调"
                }
            ]
        },{
        	"type": "手机/运营商/数码",
            "products": [
                {
                    "name": "数码相机"
                },{
                    "name": "存储卡"
                },{
                    "name": "耳机/耳麦"
                },{
                    "name": "存储卡"
                },{
                    "name": "耳机/耳麦"
                },{
                    "name": "手机"
                },{
                    "name": "智能手环"
                }
            ]
        },{
        	"type": "电脑/办公",
            "products": [
                {
                    "name": "笔记本"
                },{
                    "name": "显示器"
                },{
                    "name": "鼠标"
                },{
                    "name": "路由器"
                },{
                    "name": "投影仪"
                }
            ]
        },{
            "type": "家具/家装/厨具",
            "products": [
                {
                    "name": "收纳用品"
                },{
                    "name": "吸顶灯"
                },{
                    "name": "衣柜"
                },{
                    "name": "瓷砖"
                },{
                    "name": "电脑椅"
                }
            ]
        },{
            "type": "男装/女装/童装",
            "products": [
                {
                    "name": "牛仔裤"
                },{
                    "name": "卫衣"
                },{
                    "name": "存储卡"
                },{
                    "name": "耳机/耳麦"
                },{
                    "name": "睡衣"
                },{
                    "name": "披肩"
                },{
                    "name": "棒球帽"
                }
            ]
        },{   
            "type": "家用电器",
            "products": [
                {
                    "name": "燃气灶"
                },{
                    "name": "抽烟机"
                },{
                    "name": "存储卡"
                },{
                    "name": "耳机/耳麦"
                },{
                    "name": "存储卡"
                },{
                    "name": "耳机/耳麦"
                },{
                    "name": "热水器"
                },{
                    "name": "电视"
                },{
                    "name": "空调"
                }
            ]
        },{
            "type": "手机/运营商/数码",
            "products": [
                {
                    "name": "数码相机"
                },{
                    "name": "存储卡"
                },{
                    "name": "耳机/耳麦"
                },{
                    "name": "手机"
                },{
                    "name": "智能手环"
                }
            ]
        },{
            "type": "电脑/办公",
            "products": [
                {
                    "name": "笔记本"
                },{
                    "name": "显示器"
                },{
                    "name": "鼠标"
                },{
                    "name": "路由器"
                },{
                    "name": "投影仪"
                }
            ]
        },{
            "type": "家具/家装/厨具",
            "products": [
                {
                    "name": "收纳用品"
                },{
                    "name": "存储卡"
                },{
                    "name": "耳机/耳麦"
                },{
                    "name": "存储卡"
                },{
                    "name": "耳机/耳麦"
                },{
                    "name": "存储卡"
                },{
                    "name": "耳机/耳麦"
                },{
                    "name": "吸顶灯"
                },{
                    "name": "衣柜"
                },{
                    "name": "瓷砖"
                },{
                    "name": "电脑椅"
                }
            ]
        },{
            "type": "男装/女装/童装",
            "products": [
                {
                    "name": "牛仔裤"
                },{
                    "name": "卫衣"
                },{
                    "name": "睡衣"
                },{
                    "name": "披肩"
                },{
                    "name": "棒球帽"
                }
            ]
        },{   
            "type": "家用电器",
            "products": [
                {
                    "name": "燃气灶"
                },{
                    "name": "抽烟机"
                },{
                    "name": "热水器"
                },{
                    "name": "电视"
                },{
                    "name": "空调"
                }
            ]
        },{
            "type": "手机/运营商/数码",
            "products": [
                {
                    "name": "数码相机"
                },{
                    "name": "存储卡"
                },{
                    "name": "耳机/耳麦"
                },{
                    "name": "手机"
                },{
                    "name": "智能手环"
                }
            ]
        },{
            "type": "电脑/办公",
            "products": [
                {
                    "name": "笔记本"
                },{
                    "name": "显示器"
                },{
                    "name": "鼠标"
                },{
                    "name": "路由器"
                },{
                    "name": "投影仪"
                }
            ]
        },{
            "type": "家具/家装/厨具",
            "products": [
                {
                    "name": "收纳用品"
                },{
                    "name": "吸顶灯"
                },{
                    "name": "衣柜"
                },{
                    "name": "瓷砖"
                },{
                    "name": "电脑椅"
                }
            ]
        }
    ]
}